---
kind: method
id: M:Autodesk.Revit.DB.Structure.LoadComponent.Dispose
source: html/2f2c7f8d-471f-7d1f-0167-7ac89b30eef0.htm
---
# Autodesk.Revit.DB.Structure.LoadComponent.Dispose Method

Releases all resources used by the LoadComponent

## Syntax (C#)
```csharp
public void Dispose()
```